//==========================================================================//
//	该基类为校友信息操作类，用于校友信息将校友信息加入链表与写入文本		//
//																			//
//==========================================================================//

#pragma once
#include "Alumus.h"
class AlumusList :
	public Alumus
{
private:
	Alumus *Point;			

public:

//----------构造析构函数部分---------------------------------------------------
	AlumusList();
	~AlumusList();


//----------操作函数部分-------------------------------------------------------
	void Add_to_Link(Alumus& Temp);			//将校友信息添加到链表中
	Alumus Add_to_TXT();					//将校友信息添加到文本中
	void Remove_from_Link();				//将校友信息从链表中删除
	void Write_to_TXT();					//结束后将所有的信息写回文本
	
	Alumus *GetPoint() { return Point; }	//获得指针位置

	
};

