//==========================================================================//
//	该基类为校友信息查找排序类，用于校友信息的查找与排序					//
//																			//
//==========================================================================//

#pragma once
#include "AlumusList.h"


class Search :
	public AlumusList
{
public:

//----------构造析构函数部分---------------------------------------------------
	Search();
	~Search();


//----------操作函数部分-------------------------------------------------------
	void Find(AlumusList &su);					//查找排序校友信息
	
};

